alefragnani.project-manager
asvetliakov.vscode-neovim
chaitanyashahare.lazygit
charliermarsh.ruff
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
davidhouchin.whitespace-plus
donjayamanne.githistory
dorzey.vscode-sqlfluff
github.copilot
github.copilot-chat
gruntfuggly.todo-tree
johnnymorganz.stylua
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.python-ds-extension-pack
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.powershell
niikei.japanese-proofreading-info
njpwerner.autodocstring
shd101wyy.markdown-preview-enhanced
sherloach.solarized-osaka
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
